contest_test1 = ["在蜿蜒的山道上，李慕亡命奔逃，在途中，他听到了一只狐狸开口说话。尽管觉得不可思议，但他也不敢返回一探究竟。",
    "跑了一段路，他发现自己来到了山脚，并产生了深深的疑惑。",
    "整理脑海中的记忆，李慕得知自己来到了一个光怪陆离的世界，有修行者追求长生和神通，还有妖鬼作祟。",
    "官道上，几名捕快指责李慕侵占了县衙公人的身体，但经过一番检查，发现他只是三魂离体而已。",
    "李慕得知自己的身份是阳丘县衙捕快李慕，但只记得自己的上司李清。",
    "从捕快张山和李肆口中，李慕得知了自己的身世和这个世界的玄奇之处。",
    "尽管妖鬼听起来可怕，但从小受中国神话熏陶的李慕却感到无比刺激。",
    "回到家中，李慕发现自己身无分文，只能向张山和李肆借钱。没想到两人借口有事匆匆离去。",
    "李慕意识到自己不仅经历了死亡，还面临着新的困境和挑战。",
    "与此同时，在阳丘县外的幽谷中，一只小狐狸为李慕救命之恩而烦恼。老狐狸提醒它，狐仙一族有恩必报，但小狐狸道行太浅，只能先在山中修行，报恩之事留待日后。"]

contest_test_ja = ["蜿蜒する山道を、李慕は命からがら逃げる。途中で話すキツネの声を聞いたが、不思議に思いつつも、確かめに戻る勇気はなかった。",
    "しばらく走った後、彼は山の麓に来ていることに気づき、深い疑問を持った。",
    "頭の中の記憶を整理すると、李慕は自分が長生きと神通力を追求する修行者や、妖怪がはびこる奇妙な世界に来ていることを知った。",
    "官道で、数人の捕快が李慕に対して、県役所の公人の身体を乗っ取ったと非難したが、調べた結果、彼がただ三魂が抜けただけであることがわかった。",
    "李慕は自分が陽丘県役所の捕快、李慕であることを知り、しかし自分の上司である李清のことしか覚えていなかった。",
    "捕快の張山と李肆から、李慕は自分の身世とこの世界の神秘について知った。",
    "妖怪が恐ろしく聞こえるかもしれないが、中国の神話に小さい頃から触れていた李慕は、それを非常に刺激的に感じた。",
    "家に帰ると、李慕は自分が一文無しであることに気づき、張山と李肆にお金を借りようとしたが、二人は用事があると言って急いで去っていった。",
    "李慕は自分が死を経験しただけでなく、新たな困難と挑戦に直面していることを悟った。",
    "その一方で、陽丘県の外にある幽谷で、一匹の小さなキツネが李慕への恩返しに悩んでいた。老キツネはそれに対して、キツネ仙族は恩を必ず返すものだが、小キツネの道行が浅すぎるため、とりあえず山で修行を積み、恩返しは後日にするように言った。"]

